#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# Путем вставок и удаления символов исправить ошибки:прроцесcор, теекстовый файл, програма и аллгоритм, процесор и паммять


if __name__ == '__main__':
    s = ('прроцесcор')
    d=('теекстовый файл')
    a=('програма и аллгоритм')
    k=('процесор и паммять')
    print(s.replace('р', '', 1))
    print(d.replace('е', '', 1))
    print(a[:7], 'м', a[7:], sep='')
    print(a.replace('л', '', 1))
    print(k[:5], 'с', k[5:], sep='')
    print(k.replace('м', '', 1))