#!/usr/bin/env python3
# -*- coding: utf-8 -*-
#Дано предложение. Определить число пробелов в нем

if __name__ == '__main__':
    s = input("Введите строку: ")
    print("Количество пробелов = ", s.count(" "))



